20210926144137-career.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-07-23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>career</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css'><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">career</h1>
<div id="outline-container-org914e337" class="outline-2">
<h2 id="org914e337"><a href="#org914e337">概要</a></h2>
<div class="outline-text-2" id="text-org914e337">
<p>
プログラマーのキャリアに関することをまとめる。
</p>

<p>
キャリアのことについて考えるのはあまり面白くない。が、同じ努力で結果が大きく変わる要素のために無視してもいられない。たとえば<a href="20210509101246-programming_language.html#ID-868ac56a-2d42-48d7-ab7f-7047c85a8f39">Programming Language</a>の選択で未来は変わる。業界や領域が死ねば、精通していてもアドバンテージを失う。たまには考えないと。
</p>

<p>
よく考える疑問: 働くとしたら大企業がいいのか、<a href="20210926150739-startup.html#ID-9c5f9bfa-dc41-40b6-94cd-0791ab9d40c1">startup</a>がいいのか。あるいはフリーランス、会社を立ち上げるのがいいのか。
望むものや状況によって最善の手は変わりそうなので、よく周りと自分を理解するために書く。
</p>
</div>
</div>
<div id="outline-container-orgd94b01c" class="outline-2">
<h2 id="orgd94b01c"><a href="#orgd94b01c">Memo</a></h2>
<div class="outline-text-2" id="text-orgd94b01c">
</div>
<div id="outline-container-org9448db6" class="outline-3">
<h3 id="org9448db6"><a href="#org9448db6">やりたいことをやりきる</a></h3>
<div class="outline-text-3" id="text-org9448db6">
<p>
たとえば前職のレガシーなシステムに不満がありました、という理由は採用側から見るとクソに見える。じゃあなんで改修しないの、しようとしたの、と。結局のところ、すごい人は環境ごと変えるので、説得感のある理由にならない。環境を変えられない人は価値がない。そしてモダンな開発にも対応してないんじゃ話しにならない。
やることは2つ。
</p>
<ul class="org-ul">
<li>何かしらのレガシーの根本的な脱却をすること。モダン化すること。バージョンを上げる、ライブラリ置き換えや削除、データベースリファクタリング。</li>
<li>モダンな技術スタック開発に精通すること</li>
</ul>

<p>
どうせ離れることを考えているなら，何も失うものはないので技術的挑戦を自分から上を説得してやるのがよさそう。何も気にする必要がなくやりたい放題。それによって結局のところ会社は長期的なメリットを得る。個人も実績を積むことができるので、もはや常時離れるつもりで仕事をやったほうがいいか。少なくとも居座るつもりで挑戦しないよりは確実に良い。
</p>
</div>
</div>
<div id="outline-container-org7358b34" class="outline-3">
<h3 id="org7358b34"><a href="#org7358b34">やることを選ぶ</a></h3>
<div class="outline-text-3" id="text-org7358b34">
<p>
スキル的な面で、やりたい仕事の種類を優先づけしていくことが重要に見える。
与えられた仕事をやるだと、ジャンルがバラけて技術が蓄積しない。
割り振るのにもコストがかかる。
</p>

<p>
自分から取っていくこと、言い方を変えると選べる範囲で仕事を選ぶことが重要そうだ。選ぶというとアレな感じがするが、我慢しても見返りは来ない。やりたいことを明確に伝えないと。
</p>
</div>
</div>
<div id="outline-container-orga5bdc8d" class="outline-3">
<h3 id="orga5bdc8d"><a href="#orga5bdc8d">仕事の探し方</a></h3>
<div class="outline-text-3" id="text-orga5bdc8d">
<p>
まず自分の要件を明確にする。それから探す。カジュアル面談して掘り下げ。応募する。
</p>

<p>
資金調達額から探す。
</p>
<ul class="org-ul">
<li><a href="https://startup-db.com/">Startup DB</a></li>

<li>業種
<ul class="org-ul">
<li>toB, toC</li>
</ul></li>
<li>使用技術
<ul class="org-ul">
<li>プログラミング言語</li>
</ul></li>
<li>理想のキャリア</li>
<li>会社の規模</li>
<li>幅広くか、掘り下げか</li>
<li>リモートワーク</li>
<li>給料</li>
<li>自分がよいと思えるサービスがいい
<ul class="org-ul">
<li>とくに開発やプログラマーとして使える、使っているものだとよい。極端な例は<a href="20210926103926-github.html#ID-6b889822-21f1-4a3e-9755-e3ca52fa0bc4">GitHub</a>、CircleCIとか。自分がユーザとしてイメージできないものは作れない</li>
</ul></li>
<li>利用ユーザ数
<ul class="org-ul">
<li>多いほど要件がシビアで、知見や能力が向上する可能性は高い。例: 1000万ユーザのサービスで遅いクエリを作ると完全に止まるので、ノウハウが蓄積する。1万ユーザでは致命的に遅いクエリでないかぎり問題にならない</li>
</ul></li>
<li>ユーザとの距離感</li>
</ul>
</div>
</div>
<div id="outline-container-org547c835" class="outline-3">
<h3 id="org547c835"><a href="#org547c835">仕事内容を数字で示す</a></h3>
<div class="outline-text-3" id="text-org547c835">
<p>
アピールしよう、ってなったときでは思い出せないので重要な手柄については日頃メモしておく。リンクだけでも思い出しやすい。
</p>

<p>
期間やラベルを指定して検索した結果の(クエリがくっついた)URLを貼ると、数字として示しやすい。
</p>

<ul class="org-ul">
<li>PR数</li>
<li>Review数</li>
<li>解決Issue数(必ずやるときはAssignしておくことが重要)</li>
<li>OSS活動へのリンク</li>
</ul>
</div>
</div>
<div id="outline-container-org6b4bfcb" class="outline-3">
<h3 id="org6b4bfcb"><a href="#org6b4bfcb">聞くこと</a></h3>
<div class="outline-text-3" id="text-org6b4bfcb">
<ul class="org-ul">
<li>開発マシンに<a href="20220108110637-linux.html#ID-7a81eb7c-8e2b-400a-b01a-8fa597ea527a">Linux</a>を使えるか</li>
<li>メンバーの開発マシン・エディタはなにか
<ul class="org-ul">
<li><a href="20220108110637-linux.html#ID-7a81eb7c-8e2b-400a-b01a-8fa597ea527a">Linux</a>や<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>が多いほど良い</li>
</ul></li>
<li>開発人員の数。チームの数、チームの人数</li>
<li>GitHubを使っているか</li>
<li>チームは何の単位で分割されてるのか</li>
<li>チームごとの違いは何か</li>
<li>どのチームに配属される可能性があるのか</li>
<li>期待されているポジション。技術レベル/スタック</li>
<li>カバレッジ率はどれくらいか</li>
<li>技術負債はどうしているか</li>
<li>OSSにコントリビュートしてる人はいるか</li>
<li>会社やチームの課題は何か</li>
<li>フルリモートワークは可能か</li>
<li>オフィスに何人くらい来ているか</li>
<li>オフィスは静かか</li>
<li>ドキュメント管理はどうやっているか
<ul class="org-ul">
<li>例えば設計書はどうやって書くか</li>
</ul></li>
<li>技術選定の理由</li>
<li>GitHubやりとり見せて(review, PRコメントの感じ)</li>
<li>プロジェクト管理見せて(タスクの切り方、進めかた)</li>
<li>プロダクト見せて</li>
<li>専門領域の知識を必要とするか(例: 法律)</li>
<li>どのように開発すすめてるか</li>
<li>最近の入退職の人数</li>
</ul>
</div>
</div>
<div id="outline-container-org65665e2" class="outline-3">
<h3 id="org65665e2"><a href="#org65665e2">話すこと</a></h3>
<div class="outline-text-3" id="text-org65665e2">
<p>
高頻度で聞かれること。何を話すにも、きっかけ、ストーリーが必要なのでそのへんも考える。
</p>

<ul class="org-ul">
<li>エンジニアとして目指している方向性</li>
<li>前職を辞めた理由</li>
<li>志望理由</li>
</ul>
</div>
</div>

<div id="outline-container-org4285549" class="outline-3">
<h3 id="org4285549"><a href="#org4285549">理由のテンプレート</a></h3>
<div class="outline-text-3" id="text-org4285549">
<p>
前社で足りないものから探す。
</p>

<ul class="org-ul">
<li>開発の進め方</li>
<li>プロダクトへの興味</li>
<li>上に評価されない。任せてはもらえるものの、評価につながらない</li>
</ul>

<p>
新しいことをやりたいは、枠組みの中でなぜやらなかったという話になる。
</p>
</div>
</div>

<div id="outline-container-org814bf80" class="outline-3">
<h3 id="org814bf80"><a href="#org814bf80">効果的なコミュニケーションを行えているか</a></h3>
<div class="outline-text-3" id="text-org814bf80">
<p>
リモートワークでは<a href="20210926143523-communication.html#ID-d68263db-a8c5-478e-b456-8a753eb34416">communication</a>についての共通理解が、より重要になる。
リアルの仕事環境と異なる点。
高コンテキストでのリモートワークはやりにくい。
仕事の行いやすさに直結するだろう。
</p>

<p>
だから、集団としてどのような取り組みを行っているか、そこを整備している人間はいるか確認するとよいだろう。
</p>
</div>
</div>
<div id="outline-container-org7be8e95" class="outline-3">
<h3 id="org7be8e95"><a href="#org7be8e95">デフォルトの条件</a></h3>
<div class="outline-text-3" id="text-org7be8e95">
<ul class="org-ul">
<li>リモートワークOK</li>
<li>フルフレックス</li>
<li>人が多くない(仕事全体に自分の占める割合が多いほうがいいから。結果が見えるのがいい) かつ 技術力がある
規模というより、文化による違いの可能性が高いので再考。</li>
</ul>
</div>
</div>
<div id="outline-container-org1b5774a" class="outline-3">
<h3 id="org1b5774a"><a href="#org1b5774a">マッチョさ</a></h3>
<div class="outline-text-3" id="text-org1b5774a">
<p>
実際には面接の前の段階で勝負は決まっているように見える。だから面接で緊張する必要はない。何も武器を持たずに応募する時点で失敗しているし、すごい経験があるなら経験した時点で成功している。生き残る確実な戦略は、すでに何か難しいことを達成していて、それをオープンにできることだ。
</p>

<ul class="org-ul">
<li>業務やプライベートでの困難な経験(基本的には、業務 &gt; プライベート で評価される。責任・困難さ・他者を巻き込む的な意味で)</li>
<li>↑経験に基づく何らかの発表などの還元</li>
</ul>

<p>
それを踏まえたうえで、業務やプライベートでやることを選択する必要がある。十分に難しい、挑戦的なことをしているか、技術スタックは合っているか、等々。どんな仕事でも挑戦して何かを達成しないと、次の仕事探しで詰む。
</p>

<p>
スタック的には1つのプログラミング言語に精通していれば、ほかの言語を習得することは難しくないと予想できるので、技術スタックが一致していないことは大きな問題にならない。WEB開発の場合は、DB・API設計は共通のため、そこの技術力や経験があるかは重視される。
</p>
</div>
</div>
</div>

<div id="outline-container-org18b5228" class="outline-2">
<h2 id="org18b5228"><a href="#org18b5228">Tasks</a></h2>
</div>
<div id="outline-container-orge7b04c6" class="outline-2">
<h2 id="orge7b04c6"><a href="#orge7b04c6">Reference</a></h2>
<div class="outline-text-2" id="text-orge7b04c6">
</div>
<div id="outline-container-org8df18c1" class="outline-3">
<h3 id="org8df18c1"><a href="#org8df18c1"><a href="https://kimh.github.io/blog/7-years-in-circleci/">7年在籍したCircleCIを退職しました | Program Is Made At Night</a></a></h3>
<div class="outline-text-3" id="text-org8df18c1">
<p>
海外のスタートアップで働くこと。面白い。
</p>
</div>
</div>
<div id="outline-container-orgab97da3" class="outline-3">
<h3 id="orgab97da3"><a href="#orgab97da3"><a href="http://sakaijun.blog.jp/archives/39303583.html">シリコンバレーと日本のエンジニアの能力の違い : 酒井潤公式ブログ</a></a></h3>
<div class="outline-text-3" id="text-orgab97da3">
<blockquote>
<p>
アメリカだと、自分はPythonで専門にバックエンドでやっていくと決めたら、他のKubernetesなどの技術はインフラエンジニアの領域なので、知らなくてもいいし、任せるって感じがあります。多少Kubernetsに関しては知識として身につけることはありますが、さほどのめり込みません。
</p>

<p>
日本は他人と比較して、自分が知らないことに不安を感じ、いろんなことに手を出してしまうエンジニアが多いので、専門的な領域でプロフェッショナルになりにくいというところもあるかもしれません。
</p>
</blockquote>
<p>
超わかる。まさに自分がこの状況。
色々手を出してどれも中途半端。
</p>
</div>
</div>
<div id="outline-container-orge1c9065" class="outline-3">
<h3 id="orge1c9065"><a href="#orge1c9065"><a href="https://www.amazon.co.jp/dp/B010UV1QTW/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1">ワーク・ルールズ！―君の生き方とリーダーシップを変える | ラズロ・ボック, 鬼澤 忍, 矢羽野 薫 | ビジネス・経済 | Kindleストア | Amazon</a></a></h3>
<div class="outline-text-3" id="text-orge1c9065">
<p>
Googleの働き方の解説。
</p>
</div>
</div>
<div id="outline-container-org6e906d4" class="outline-3">
<h3 id="org6e906d4"><a href="#org6e906d4"><a href="https://qiita.com/iwtn/items/d3849854208aca513c9d">バックエンドエンジニアの役割の整理と今後何をやっていけばいいか - Qiita</a></a></h3>
<div class="outline-text-3" id="text-org6e906d4">
<p>
バックエンドエンジニアについての整理。
</p>
</div>
</div>
<div id="outline-container-org0d8b20c" class="outline-3">
<h3 id="org0d8b20c"><a href="#org0d8b20c"><a href="https://openviewpartners.com/blog/the-product-led-growth-market-map/#.YVB533UzbyL">The Product Led Growth Market Map - OpenView</a></a></h3>
<div class="outline-text-3" id="text-org0d8b20c">
<p>
プロダクトを成長させる市場。こういう企業を狙うとよさそう。
</p>
</div>
</div>
<div id="outline-container-org2c0d008" class="outline-3">
<h3 id="org2c0d008"><a href="#org2c0d008"><a href="https://www.docswell.com/s/shu223/YZ98P5-enjoy?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=singlepage#p1">エンジニアという仕事を楽しみ続けるためには | ドクセル</a></a></h3>
<div class="outline-text-3" id="text-org2c0d008">
<p>
技術の選択、プログラマとしてのブランディング、キャリア論。
</p>
</div>
</div>
<div id="outline-container-org207c94b" class="outline-3">
<h3 id="org207c94b"><a href="#org207c94b"><a href="https://github.com/kdn251/interviews">kdn251/interviews: Everything you need to know to get the job.</a></a></h3>
<div class="outline-text-3" id="text-org207c94b">
<p>
interview対策。
</p>
</div>
</div>
<div id="outline-container-orgbce0612" class="outline-3">
<h3 id="orgbce0612"><a href="#orgbce0612"><span class="todo TODO">TODO</span> <a href="http://media.steampowered.com/apps/valve/Valve_NewEmployeeHandbook.pdf">VALVE handbook for new employees</a></a></h3>
<div class="outline-text-3" id="text-orgbce0612">
<p>
VALVEの新入社員ガイド。
</p>
</div>
</div>
<div id="outline-container-orgd9e42a0" class="outline-3">
<h3 id="orgd9e42a0"><a href="#orgd9e42a0"><a href="https://tkybpp.hatenablog.com/entry/2018/05/16/073000">【翻訳】「シリコンバレーから生まれた最高の文書」と絶賛されたNetflixのカルチャーガイド全文 - BppLOG</a></a></h3>
<div class="outline-text-3" id="text-orgd9e42a0">
<p>
Netflixのカルチャーガイドの翻訳。
</p>
</div>
</div>
<div id="outline-container-org2786302" class="outline-3">
<h3 id="org2786302"><a href="#org2786302"><a href="https://jobs.netflix.com/culture">Netflix Jobs</a></a></h3>
<div class="outline-text-3" id="text-org2786302">
<p>
Netflixのカルチャーガイド。日本語訳もある。
</p>
</div>
</div>
<div id="outline-container-orga9593a2" class="outline-3">
<h3 id="orga9593a2"><a href="#orga9593a2"><a href="https://www.slideshare.net/reed2001/culture-1798664">Netflix Culture</a></a></h3>
<div class="outline-text-3" id="text-orga9593a2">
<p>
スライドバージョン。
</p>
</div>
</div>
<div id="outline-container-org35ed3e7" class="outline-3">
<h3 id="org35ed3e7"><a href="#org35ed3e7"><a href="https://dropbox.github.io/dbx-career-framework/overview.html">Overview - Dropbox Engineering Career Framework</a></a></h3>
<div class="outline-text-3" id="text-org35ed3e7">
<p>
Dropboxのキャリアの文書化。
</p>
</div>
</div>
</div>
<div id="outline-container-org10e0613" class="outline-2">
<h2 id="org10e0613"><a href="#org10e0613">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
